import React from 'react';


const initialState = {   
    tabs: [
        {
            title: "Новый город (пр-т Врача Сурова, д.4)",
            status: "surova"
        },
        {
            title: "Центр (ул. Бебеля, 1А)",
            status: "bebelya"
        },
        {
            title: "Генетические исследования",
            status: "geneticResearch"
        }
    ],
    content: {
        surova: [
            {
                firstCell: "Раздел 1",
                secondCell: "100",
                thirdCell: "Консультационно - диагностическое отделение",
                fourthСell: "",
                chapter: true            
            },
            {
                firstCell: "1.1",
                secondCell: "",
                thirdCell: "Врачебные лечебно-диагностические услуги",
                fourthСell: "",
                subChapter: true            
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.01",
                thirdCell: "Прием врача-акушера-гинеколога первичный (комплексный осмотр репродуктолога: консультация врача, инструментальный осмотр, УЗИ обследование)",
                fourthСell: "1 800,00"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.02",
                thirdCell: "Прием врача-акушера-гинеколога первичный (репродуктолог)",
                fourthСell: "1 100,00"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.02.01",
                thirdCell: "Прием врача-акушера-гинеколога первичный (репродуктолог, кандидат медицинских наук)",
                fourthСell: "1200,00"                       
            }, 
            {
                firstCell: "B01.001.002",
                secondCell: "100.03",
                thirdCell: "Прием врача-акушера-гинеколога повторный (репродуктолог)",
                fourthСell: "1 000,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "100.03.01",
                thirdCell: "Прием врача-акушера-гинеколога повторный (репродуктолог, кандидат медицинских наук)",
                fourthСell: "1100,00"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.05",
                thirdCell: "Прием врача-акушера - гинеколога первичный (Комплекс: консультация врача, обследование в смотровом кабинете, инструментальный осмотр, ультразвуковое исследование)",
                fourthСell: "1700"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.06",
                thirdCell: "Прием врача-акушера - гинеколога первичный",
                fourthСell: "1000,00"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.06.1",
                thirdCell: "Прием врача-акушера - гинеколога  первичный (кандидат медицинских наук)",
                fourthСell: "1100,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "100.07",
                thirdCell: "Прием врача-акушера - гинеколога повторный",
                fourthСell: "900,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "100.07.1",
                thirdCell: "Прием врача-акушера - гинеколога повторный (кандидат медицинских услуг)",
                fourthСell: "1000,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "100.27",
                thirdCell: "Прием врача-акушера-гинеколога повторный  (выписка из амбулаторной карты)",
                fourthСell: "600,00"                       
            },
            {
                firstCell: "B01.053.001 ",
                secondCell: "100.08",
                thirdCell: "Прием врача-уролога первичный",
                fourthСell: "950,00"                       
            },
            {
                firstCell: "B01.053.001",
                secondCell: "100.08.1",
                thirdCell: "Прием врача-уролога первичный (кандидат медицинских наук)",
                fourthСell: "1050,00"                       
            },
            {
                firstCell: "B01.053.001",
                secondCell: "100.08.2",
                thirdCell: "Прием врача-уролога первичный (доктор медицинских наук)",
                fourthСell: "2000,00"                       
            },
            {
                firstCell: "B01.053.002 ",
                secondCell: "100.09",
                thirdCell: "Прием врача-уролога повторный",
                fourthСell: "750,00"                       
            },
            {
                firstCell: "B01.053.002",
                secondCell: "100.09.1",
                thirdCell: "Прием врача-уролога повторный (кандидат медицинских наук)",
                fourthСell: "800,00"                       
            },
            {
                firstCell: "B01.053.002",
                secondCell: "100.09.2",
                thirdCell: "Прием врача-уролога повторный (доктор медицинских наук)",
                fourthСell: "1930,00"                       
            },
            {
                firstCell: "B01.015.001 ",
                secondCell: "Б100.12",
                thirdCell: "Прием врача-кардиолога (терапевта)  первичный ",
                fourthСell: "1100,00"                       
            },
            {
                firstCell: "B01.015.002",
                secondCell: "Б100.12.1",
                thirdCell: "Прием врача-кардиолога (терапевта) повторный",
                fourthСell: "1000,00"                       
            },
            {
                firstCell: "B01.058.001 ",
                secondCell: "100.13",
                thirdCell: "Прием врача-эндокринолога первичный",
                fourthСell: "1000,00"                       
            },
            {
                firstCell: "B01.058.002",
                secondCell: "100.13.1",
                thirdCell: "Прием врача-эндокринолога повторный",
                fourthСell: "900,00"                       
            },
            {
                firstCell: "B01.047.001 ",
                secondCell: "100.15",
                thirdCell: "Прием врача-терапевта первичный",
                fourthСell: "900,00"                       
            },
            {
                firstCell: "B01.047.002 ",
                secondCell: "100.15.1",
                thirdCell: "Прием врача-терапевта повторный",
                fourthСell: "800,00"                       
            },
            {
                firstCell: "B01.050.001 ",
                secondCell: "Б100.41",
                thirdCell: "Прием врача-травматолога-ортопеда первичный",
                fourthСell: "1000,00"                       
            },
            {
                firstCell: "B01.050.002",
                secondCell: "Б100.41.1",
                thirdCell: "Прием врача-травматолога-ортопеда повторный",
                fourthСell: "900,00"                       
            },
            {
                firstCell: "B01.027.002 ",
                secondCell: "Б100.42",
                thirdCell: "Прием врача-онколога первичный",
                fourthСell: "1000,00"                       
            },
            {
                firstCell: "B01.027.003",
                secondCell: "Б100.42.1",
                thirdCell: "Прием врача-онколога повторный",
                fourthСell: "900,00"                       
            },
            {
                firstCell: "",
                secondCell: "",
                thirdCell: "Приемы врачей-специалистов перед вводом в программу ЭКО по ОМС",
                fourthСell: "",
                title: true
            },
            {
                firstCell: "B01.001.002",
                secondCell: "100.45",
                thirdCell: "Прием врача-акушера-гинеколога повторный (оформление репродуктологом выписки на проведение ЭКО по ОМС)",
                fourthСell: "3000,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "100.45.1",
                thirdCell: "Прием врача-акушера-гинеколога повторный (срочное оформление репродуктологом выписки на проведение ЭКО по ОМС)",
                fourthСell: "5000,00"                       
            },
            {
                firstCell: "B01.047.002",
                secondCell: "100.17",
                thirdCell: "Консультация врача-терапевта (допуск к программе ЭКО/гистероскопии)",
                fourthСell: "800,00"                       
            },
            {
                firstCell: "",
                secondCell: "",
                thirdCell: "Консультации врачей-специалистов по результатам обследования",
                fourthСell: "",
                title: true                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "100.38",
                thirdCell: "Консультация врача-акушера-гинеколога повторная (по результатам обследования)",
                fourthСell: "500,00"                       
            },
            {
                firstCell: "B01.047.002",
                secondCell: "100.38.1",
                thirdCell: "Консультация врача-терапевта повторная (по результатам обследования)",
                fourthСell: "500,00"                       
            },
            {
                firstCell: "B01.053.002",
                secondCell: "100.38.2",
                thirdCell: "Консультация врача-уролога повторная (по результатам обследования)",
                fourthСell: "500,00"                       
            },
            {
                firstCell: "",
                secondCell: "",
                thirdCell: "Ведение беременности",
                fourthСell: "",
                title: true                      
            },
            {
                firstCell: "B01.001.004",
                secondCell: "100.21",
                thirdCell: "Прием врача-акушера-гинеколога беременной первичный (Комплекс: консультация врача, обследование в смотровом кабинете, инструментальный осмотр, для беременных, не состоящих на учете в клинике)",
                fourthСell: "1300,00"                       
            },
            {
                firstCell: "B01.001.005",
                secondCell: "100.21.1",
                thirdCell: "Прием врача-акушера-гинеколога беременной повторный  (Комплекс: :консультация врача, обследование в смотровом кабинете, инструментальный осмотр, для беременных, не состоящих на учете в клинике)",
                fourthСell: "950,00"                       
            },
            {
                firstCell: "B01.001.004",
                secondCell: "100.22",
                thirdCell: "Прием врача-акушера-гинеколога беременной первичный (Программа первичного обследования для постановки на учет и ведение беременности: скрининг УЗИ, скрининг биохимический, полное обследование и осмотр специалистов согласно приказу МЗ РФ)",
                fourthСell: "15000,00"                       
            },
            {
                firstCell: "B01.001.005 ",
                secondCell: "100.23",
                thirdCell: "Прием врача-акушера-гинеколога беременной повторный (Ведение беременности 1 триместр: скрининг УЗИ, скрининг биохимический, полное обследование и осмотр специалистов согласно приказу МЗ РФ, 2 посещения по 30 мин.)",
                fourthСell: "8000,00"                       
            },
            {
                firstCell: "B01.001.005",
                secondCell: "100.24",
                thirdCell: "Прием врача-акушера-гинеколога беременной повторный (Ведение беременности 2 триместр: скрининг УЗИ, скрининг биохимический, полное обследование согласно приказу МЗ РФ, 5 посещений по 30 мин.)",
                fourthСell: "13000,00"                       
            },
            {
                firstCell: "B01.001.005",
                secondCell: "100.25",
                thirdCell: "Прием врача-акушера-гинеколога беременной повторный (Ведение беременности 3 триместр: скрининг УЗИ, полное обследование, а так же: КТГ плода и осмотр специалистов согласно приказу МЗ РФ, 8 посещений по 30 мин.)",
                fourthСell: "26000,00"                       
            },
            {
                firstCell: "",
                secondCell: "",
                thirdCell: "Дистанционное консультирование",
                fourthСell: "",
                title: true                      
            },
            {
                firstCell: "В01.001.001",
                secondCell: "ДИС100.02",
                thirdCell: "Консультация врача-акушера-гинеколога первичная (репродуктолог, дистанционное информирование)",
                fourthСell: "500,00"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "ДИС100.02.01",
                thirdCell: "Консультация врача-акушера-гинеколога  первичная (репродуктолог, кандидат медицинских наук, дистанционное информирование)",
                fourthСell: "600,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "ДИС100.03",
                thirdCell: "Консультация врача-акушера-гинеколога повторная (репродуктолог, дистанционная)",
                fourthСell: "850,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "ДИС100.03.01",
                thirdCell: "Консультация врача-акушера-гинеколога повторная (репродуктолог, кандидат медицинских наук, дистанционная)",
                fourthСell: "950,00"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "ДИС100.06",
                thirdCell: "Консультация врача-акушера - гинеколога первичная (дистанционное информирование)",
                fourthСell: "500,00"                       
            },
            {
                firstCell: "B01.001.002",
                secondCell: "ДИС100.07",
                thirdCell: "Консультация врача-акушера - гинеколога повторная (дистанционная)",
                fourthСell: "800,00"                       
            },
            {
                firstCell: "B01.053.001",
                secondCell: "ДИС100.08",
                thirdCell: "Консультация врача-уролога первичная (дистанционное информирование)",
                fourthСell: "500,00"                       
            },
            {
                firstCell: "B01.053.002",
                secondCell: "ДИС100.09",
                thirdCell: "Консультация врача-уролога повторная (дистанционная)",
                fourthСell: "700,00"                       
            },
            {
                firstCell: "B01.053.002",
                secondCell: "ДИС100.09.2",
                thirdCell: "Консультация врача-уролога повторная (дистанционная, доктор медицинских наук)",
                fourthСell: "1350,00"                       
            },
            {
                firstCell: "B01.058.001",
                secondCell: "ДИС100.13",
                thirdCell: "Консультация врача-эндокринолога первичная (дистанционное информирование)",
                fourthСell: "500,00"                       
            },
            {
                firstCell: "B01.058.002",
                secondCell: "ДИС100.13.1",
                thirdCell: "Консультация врача-эндокринолога повторная (дистанционная)",
                fourthСell: "700,00"                       
            },
            {
                firstCell: "B01.047.002",
                secondCell: "ДИС100.15.1",
                thirdCell: "Консультация врача-терапевта повторная (дистанционная)",
                fourthСell: "600,00"                       
            },
            {
                firstCell: "",
                secondCell: "",
                thirdCell: "Функциональное обследование",
                fourthСell: "",
                title: true                       
            },
            {
                firstCell: "А01.30",
                secondCell: "Б100.44",
                thirdCell: "Пред-послерейсовый осмотр водителя",
                fourthСell: "100"                       
            },
            {
                firstCell: "1.2",
                secondCell: "100",
                thirdCell: "Процедуры и лечебные манипуляции",
                fourthСell: "",
                subChapter: true            
            },
            {
                firstCell: "1.2.1",
                secondCell: "",
                thirdCell: "Гинекология и урология",
                fourthСell: "",
                subSubChapter: true            
            },

        ],
        bebelya: [
            {
                firstCell: "Раздел 1",
                secondCell: "100",
                thirdCell: "Консультационно - диагностическое отделение",
                fourthСell: "",
                chapter: true            
            },
            {
                firstCell: "1.1",
                secondCell: "",
                thirdCell: "Врачебные лечебно-диагностические услуги",
                fourthСell: "",
                subChapter: true            
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.01",
                thirdCell: "Прием врача-акушера-гинеколога первичный (комплексный осмотр репродуктолога: консультация врача, инструментальный осмотр, УЗИ обследование)",
                fourthСell: "2 300,00"                       
            },
            {
                firstCell: "В01.001.001",
                secondCell: "100.02",
                thirdCell: "Прием врача-акушера-гинеколога первичный (репродуктолог)",
                fourthСell: "1 800,00"                       
            },       
        ],
        geneticResearch: [
            {
                firstCell: "01110",
                secondCell: "8",
                thirdCell: "НИПС Т21 - Неинвазивный пренатальный ДНК скрининг на синдром Дауна",
                fourthСell: "23 000, 00",                        
            },
        ]
    }     
}

export type initialStateType = typeof initialState;

export const pricesReducer = (state = initialState, action:any):initialStateType => {
    return state;
};